In [4]:
import pandas as pd

# 粗略查看数据信息

In [3]:
data = pd.read_csv('D:/d/python/us.csv')

In [4]:
data.head()

   user_id  age sex  occupation zip_code
0        1   24   M  technician    85711
1        2   53   F       other    94043
2        3   23   M      writer    32067
3        4   24   M  technician    43537
4        5   33   F       other    15213

# 分析begin

In [6]:
u_data = pd.read_csv('D:/d/python/ml-100k/u.data')
u_genre = pd.read_csv('D:/d/python/ml-100k/u.genre')
u_info = pd.read_csv('D:/d/python/ml-100k/u.info')
#u_item = pd.read_csv('D:/d/python/ml-100k/u.item')
u_occupation = pd.read_csv('D:/d/python/ml-100k/u.occupation')
u_user = pd.read_csv('D:/d/python/ml-100k/u.user')

In [7]:
u_data.head()

   196\t242\t3\t881250949
0  186\t302\t3\t891717742
1   22\t377\t1\t878887116
2   244\t51\t2\t880606923
3  166\t346\t1\t886397596
4  298\t474\t4\t884182806

In [8]:
u_user.head()

   1|24|M|technician|85711
0       2|53|F|other|94043
1      3|23|M|writer|32067
2  4|24|M|technician|43537
3       5|33|F|other|15213
4   6|42|M|executive|98101

In [ ]:
# 分析end

In [5]:
names = ['user_id','age','gender','occupation','zip_code']
u_user = pd.read_csv('D:/d/python/ml-100k/u.user', sep='|', names=names)
#nones = u_user[u_user['occupation'] == 'none']
#u_user = u_user.drop(nones.index)

In [10]:
u_user.head()

   user_id  age gender  occupation zip_code
0        1   24      M  technician    85711
1        2   53      F       other    94043
2        3   23      M      writer    32067
3        4   24      M  technician    43537
4        5   33      F       other    15213

# 去掉occupation为none的记录

In [6]:
u_user[u_user.isnull().T.any()]

Empty DataFrame
Columns: [user_id, age, gender, occupation, zip_code]
Index: []

In [10]:
nones = u_user[u_user['occupation'] == 'none']

In [11]:
nones.index

Int64Index([56, 126, 129, 255, 288, 417, 627, 656, 755], dtype='int64')

In [12]:
u_user.shape

(943, 5)

In [13]:
u_user = u_user.drop(nones.index)

In [14]:
u_user.shape

(934, 5)

# gender中的m、f映射成0、 1

In [11]:
u_user['gender'] = u_user['gender'].map({'M':1, 'F':0})

# 对age进行分段，映射成7组

In [12]:
u_user.head()

   user_id  age  gender  occupation zip_code
0        1   24       1  technician    85711
1        2   53       0       other    94043
2        3   23       1      writer    32067
3        4   24       1  technician    43537
4        5   33       0       other    15213

In [14]:
def age_map(age):
    if age >= 1 and age <= 7: return 1
    if age >= 8 and age <=16: return 2
    if age >=17 and age <= 29: return 3
    if age >= 30 and age <= 39: return 4
    if age >= 40 and age <= 49: return 5
    if age >= 50 and age <= 59: return 6
    if age >= 60: return 7

In [15]:
u_user['age'] = u_user['age'].apply(lambda age : age_map(age))

In [16]:
u_user.head()

   user_id  age  gender  occupation zip_code
0        1    3       1  technician    85711
1        2    6       0       other    94043
2        3    3       1      writer    32067
3        4    3       1  technician    43537
4        5    4       0       other    15213

#  occupation字段数值化

In [ ]:
# 分析begin

In [17]:
occupations = u_user['occupation'].unique()

In [18]:
occupations

array(['technician', 'other', 'writer', 'executive', 'administrator',
       'student', 'lawyer', 'educator', 'scientist', 'entertainment',
       'programmer', 'librarian', 'homemaker', 'artist', 'engineer',
       'marketing', 'none', 'healthcare', 'retired', 'salesman', 'doctor'],
      dtype=object)

In [22]:
occupations_dict = {occupation:index for index, occupation in enumerate(occupations) }

In [23]:
occupations_dict

{'technician': 0,
 'other': 1,
 'writer': 2,
 'executive': 3,
 'administrator': 4,
 'student': 5,
 'lawyer': 6,
 'educator': 7,
 'scientist': 8,
 'entertainment': 9,
 'programmer': 10,
 'librarian': 11,
 'homemaker': 12,
 'artist': 13,
 'engineer': 14,
 'marketing': 15,
 'none': 16,
 'healthcare': 17,
 'retired': 18,
 'salesman': 19,
 'doctor': 20}

In [ ]:
# 分析 end

In [25]:
def occupations_map(occupation):
    occupations_dict = {'technician': 1,
     'other': 0,
     'writer': 2,
     'executive': 3,
     'administrator': 4,
     'student': 5,
     'lawyer': 6,
     'educator': 7,
     'scientist': 8,
     'entertainment': 9,
     'programmer': 10,
     'librarian': 11,
     'homemaker': 12,
     'artist': 13,
     'engineer': 14,
     'marketing': 15,
     'none': 16,
     'healthcare': 17,
     'retired': 18,
     'salesman': 19,
     'doctor': 20}
    return occupations_dict[occupation]

In [27]:
u_user['occupation'] = u_user['occupation'].apply(lambda occupation : occupations_map(occupation))

In [28]:
u_user.head()

   user_id  age  gender  occupation zip_code
0        1    3       1           1    85711
1        2    6       0           0    94043
2        3    3       1           2    32067
3        4    3       1           1    43537
4        5    4       0           0    15213

#  zip_code提取前3位

In [39]:
u_user['zip_code'] = u_user['zip_code'].apply(lambda zip_code : str(zip_code)[:3])

ValueError: invalid literal for int() with base 10: 'T8H'

In [40]:
u_user.head()

   user_id  age  gender  occupation zip_code
0        1    3       1           1      857
1        2    6       0           0      940
2        3    3       1           2      320
3        4    3       1           1      435
4        5    4       0           0      152

In [34]:
type(u_user)

pandas.core.frame.DataFrame

In [35]:
u_user.shape

(943, 5)

In [36]:
type(u_user['user_id'])

pandas.core.series.Series

In [37]:
print(type(u_user['user_id']))

<class 'pandas.core.series.Series'>

# 处理好的数据保存，留待后续直接使用

In [29]:
u_user.to_csv('D:/d/python/u_result.csv')